; domain
(define (domain satellite)
  (:requirements :strips :equality :typing)
  (:types satellite direction instrument mode)

  (:predicates 
    (on_board ?i - instrument ?s - satellite)
    (supports ?i - instrument ?m - mode)
    (pointing ?s - satellite ?d - direction)
    (power_avail ?s - satellite)
    (power_on ?i - instrument)
    (calibrated ?i - instrument)
    (have_image ?d - direction ?m - mode)
    (calibration_target ?i - instrument ?d - direction))

  ;; Acción 1: Girar el satélite
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev) (not (= ?d_new ?d_prev)))
   :effect (and (pointing ?s ?d_new) (not (pointing ?s ?d_prev))))

  ;; Acción 2: Encender instrumento
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) (power_avail ?s))
   :effect (and (power_on ?i) (not (power_avail ?s))))

  ;; Acción 3: Apagar instrumento (para recuperar energía)
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) (power_on ?i))
   :effect (and (not (power_on ?i)) (power_avail ?s)))

  ;; Acción 4: Calibrar instrumento
  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s) (pointing ?s ?d) (calibration_target ?i ?d) (power_on ?i))
   :effect (calibrated ?i))

  ;; Acción 5: Tomar imagen (El objetivo final)
  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i) (on_board ?i ?s) (supports ?i ?m) (power_on ?i) (pointing ?s ?d))
   :effect (have_image ?d ?m))
)

; problem
(define (problem strips-sat-x-5)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	spectrograph2 - mode
	thermograph1 - mode
	image0 - mode
	GroundStation2 - direction
	GroundStation1 - direction
	GroundStation0 - direction
	Star3 - direction
	Star4 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon8)
	(supports instrument1 thermograph1)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(supports instrument2 image0)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon5)
)
(:goal (and
	(have_image Star3 thermograph1)
	(have_image Star4 spectrograph2)
	(have_image Phenomenon5 image0)
	(have_image Phenomenon6 image0)
	(have_image Star7 spectrograph2)
	(have_image Phenomenon8 image0)
	(have_image Planet9 spectrograph2)
))
)

; plan
1. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (turn_to satellite2 groundstation0 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 groundstation0)
   goals met: 0 of 7
4. (calibrate satellite2 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 0 of 7
5. (turn_to satellite2 phenomenon5 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 phenomenon5)
   goals met: 0 of 7
6. (take_image satellite2 phenomenon5 instrument2 image0)
   added: (have_image phenomenon5 image0)
   goals met: 1 of 7
7. (turn_to satellite2 phenomenon6 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 phenomenon6)
   goals met: 1 of 7
8. (take_image satellite2 phenomenon6 instrument2 image0)
   added: (have_image phenomenon6 image0)
   goals met: 2 of 7
9. (turn_to satellite2 phenomenon8 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 phenomenon8)
   goals met: 2 of 7
10. (take_image satellite2 phenomenon8 instrument2 image0)
   added: (have_image phenomenon8 image0)
   goals met: 3 of 7
11. (turn_to satellite2 star3 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 star3)
   goals met: 3 of 7
12. (take_image satellite2 star3 instrument2 thermograph1)
   added: (have_image star3 thermograph1)
   goals met: 4 of 7
13. (turn_to satellite0 groundstation2 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation2)
   goals met: 4 of 7
14. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 4 of 7
15. (turn_to satellite0 planet9 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet9)
   goals met: 4 of 7
16. (take_image satellite0 planet9 instrument0 spectrograph2)
   added: (have_image planet9 spectrograph2)
   goals met: 5 of 7
17. (turn_to satellite0 star4 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star4)
   goals met: 5 of 7
18. (take_image satellite0 star4 instrument0 spectrograph2)
   added: (have_image star4 spectrograph2)
   goals met: 6 of 7
19. (turn_to satellite0 star7 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star7)
   goals met: 6 of 7
20. (take_image satellite0 star7 instrument0 spectrograph2)
   added: (have_image star7 spectrograph2)
   goals met: 7 of 7
